# 객체생성

In [33]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt

In [34]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [35]:
dates = pd.date_range('20130101', periods=6)

In [36]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [69]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [70]:
df

                   A         B         C         D
2013-01-01  0.984569  0.337091 -0.043185 -1.045528
2013-01-02  0.669345  1.888401  1.012291 -0.568639
2013-01-03  0.365531 -0.232054  0.813464 -0.467959
2013-01-04  1.011553  0.432133 -0.391939  0.872897
2013-01-05 -1.037115  0.153557  0.256157 -1.477298
2013-01-06 -1.183550  0.172103  0.583739  0.074280

In [72]:
df2 = pd.DataFrame({'A' : 1,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4, dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'})

In [73]:
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [75]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터확인하기

In [80]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.011553  0.432133 -0.391939  0.872897
2013-01-05 -1.037115  0.153557  0.256157 -1.477298
2013-01-06 -1.183550  0.172103  0.583739  0.074280

In [83]:
df.tail()

                   A         B         C         D
2013-01-02  0.669345  1.888401  1.012291 -0.568639
2013-01-03  0.365531 -0.232054  0.813464 -0.467959
2013-01-04  1.011553  0.432133 -0.391939  0.872897
2013-01-05 -1.037115  0.153557  0.256157 -1.477298
2013-01-06 -1.183550  0.172103  0.583739  0.074280

In [84]:
df.head()

                   A         B         C         D
2013-01-01  0.984569  0.337091 -0.043185 -1.045528
2013-01-02  0.669345  1.888401  1.012291 -0.568639
2013-01-03  0.365531 -0.232054  0.813464 -0.467959
2013-01-04  1.011553  0.432133 -0.391939  0.872897
2013-01-05 -1.037115  0.153557  0.256157 -1.477298

In [85]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.011553  0.432133 -0.391939  0.872897
2013-01-05 -1.037115  0.153557  0.256157 -1.477298
2013-01-06 -1.183550  0.172103  0.583739  0.074280

In [86]:
#인덱스,열 그리고 numpy 데이터에 대한 세부 정보를 봅니다.
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [87]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [88]:
df.values

array([[ 0.98456902,  0.33709134, -0.04318548, -1.04552846],
       [ 0.66934507,  1.88840067,  1.01229146, -0.56863916],
       [ 0.36553054, -0.23205367,  0.81346443, -0.46795895],
       [ 1.01155304,  0.43213335, -0.39193871,  0.87289717],
       [-1.03711479,  0.15355741,  0.25615675, -1.47729812],
       [-1.18354994,  0.17210329,  0.58373864,  0.07427992]])

In [89]:
df.describe() #통계적정보 출력

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.135055  0.458539  0.371755 -0.435375
std    0.994103  0.736468  0.532747  0.830426
min   -1.183550 -0.232054 -0.391939 -1.477298
25%   -0.686453  0.158194  0.031650 -0.926306
50%    0.517438  0.254597  0.419948 -0.518299
75%    0.905763  0.408373  0.756033 -0.061280
max    1.011553  1.888401  1.012291  0.872897

In [90]:
#데이터를 전치
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.984569    0.669345    0.365531    1.011553   -1.037115   -1.183550
B    0.337091    1.888401   -0.232054    0.432133    0.153557    0.172103
C   -0.043185    1.012291    0.813464   -0.391939    0.256157    0.583739
D   -1.045528   -0.568639   -0.467959    0.872897   -1.477298    0.074280

In [93]:
#축 별로 정렬(칼럼순서정렬)
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.045528 -0.043185  0.337091  0.984569
2013-01-02 -0.568639  1.012291  1.888401  0.669345
2013-01-03 -0.467959  0.813464 -0.232054  0.365531
2013-01-04  0.872897 -0.391939  0.432133  1.011553
2013-01-05 -1.477298  0.256157  0.153557 -1.037115
2013-01-06  0.074280  0.583739  0.172103 -1.183550

In [96]:
# 값 별로 정렬
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  0.365531 -0.232054  0.813464 -0.467959
2013-01-05 -1.037115  0.153557  0.256157 -1.477298
2013-01-06 -1.183550  0.172103  0.583739  0.074280
2013-01-01  0.984569  0.337091 -0.043185 -1.045528
2013-01-04  1.011553  0.432133 -0.391939  0.872897
2013-01-02  0.669345  1.888401  1.012291 -0.568639

# 선택

In [99]:
df['A']

2013-01-01    0.984569
2013-01-02    0.669345
2013-01-03    0.365531
2013-01-04    1.011553
2013-01-05   -1.037115
2013-01-06   -1.183550
Freq: D, Name: A, dtype: float64

In [104]:
df[['A','C']]

                   A         C
2013-01-01  0.984569 -0.043185
2013-01-02  0.669345  1.012291
2013-01-03  0.365531  0.813464
2013-01-04  1.011553 -0.391939
2013-01-05 -1.037115  0.256157
2013-01-06 -1.183550  0.583739

In [102]:
#행을 분할하는 []를 통해 선택
df[0:3]

                   A         B         C         D
2013-01-01  0.984569  0.337091 -0.043185 -1.045528
2013-01-02  0.669345  1.888401  1.012291 -0.568639
2013-01-03  0.365531 -0.232054  0.813464 -0.467959

In [105]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.669345  1.888401  1.012291 -0.568639
2013-01-03  0.365531 -0.232054  0.813464 -0.467959
2013-01-04  1.011553  0.432133 -0.391939  0.872897

In [106]:
#Label을 통한 선택
df.loc[dates[0]]

A    0.984569
B    0.337091
C   -0.043185
D   -1.045528
Name: 2013-01-01 00:00:00, dtype: float64

In [108]:
#라벨을 사용하여 여러축을 얻습니다.
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.984569  0.337091
2013-01-02  0.669345  1.888401
2013-01-03  0.365531 -0.232054
2013-01-04  1.011553  0.432133
2013-01-05 -1.037115  0.153557
2013-01-06 -1.183550  0.172103

In [109]:
#양쪽 종단점을 포함한 라벨 슬라이싱을 본다
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.669345  1.888401
2013-01-03  0.365531 -0.232054
2013-01-04  1.011553  0.432133

In [110]:
#반환되는 객체의 차원을 줄인다
df.loc['20130102',['A','B']]

A    0.669345
B    1.888401
Name: 2013-01-02 00:00:00, dtype: float64

In [111]:
#스칼라 값을 얻는다
df.loc[dates[0],'A']

0.9845690232838596

In [112]:
df.at[dates[0],'A']

0.9845690232838596

In [113]:
# 위치로 선택
df.iloc[3]

A    1.011553
B    0.432133
C   -0.391939
D    0.872897
Name: 2013-01-04 00:00:00, dtype: float64

In [129]:
# A:B , B-1값까지 나옴
df.iloc[3:5,0:3]

                   A         B         C
2013-01-04  1.011553  0.432133 -0.391939
2013-01-05 -1.037115  0.153557  0.256157

In [124]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.669345  1.012291
2013-01-03  0.365531  0.813464
2013-01-05 -1.037115  0.256157

In [132]:
#명시적으로 행 나누기
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.669345  1.888401  1.012291 -0.568639
2013-01-03  0.365531 -0.232054  0.813464 -0.467959

In [133]:
#명시적으로 열 나누기
df.iloc[:,1:3]

                   B         C
2013-01-01  0.337091 -0.043185
2013-01-02  1.888401  1.012291
2013-01-03 -0.232054  0.813464
2013-01-04  0.432133 -0.391939
2013-01-05  0.153557  0.256157
2013-01-06  0.172103  0.583739

In [134]:
df.iloc[1,1]

1.8884006675788996

In [135]:
#스칼라값을 빠르게 얻는방법
df.iat[1,1]

1.8884006675788996

In [141]:
#데이터를 선택하기 위해 단일 열의 값을 사용
df[df.A>0]

                   A         B         C         D
2013-01-01  0.984569  0.337091 -0.043185 -1.045528
2013-01-02  0.669345  1.888401  1.012291 -0.568639
2013-01-03  0.365531 -0.232054  0.813464 -0.467959
2013-01-04  1.011553  0.432133 -0.391939  0.872897

In [142]:
df[df >0]

                   A         B         C         D
2013-01-01  0.984569  0.337091       NaN       NaN
2013-01-02  0.669345  1.888401  1.012291       NaN
2013-01-03  0.365531       NaN  0.813464       NaN
2013-01-04  1.011553  0.432133       NaN  0.872897
2013-01-05       NaN  0.153557  0.256157       NaN
2013-01-06       NaN  0.172103  0.583739  0.074280

In [143]:
df2=df.copy()

In [144]:
df2['E'] = ['one','one','two','three','four','three']

In [145]:
df2

                   A         B         C         D      E
2013-01-01  0.984569  0.337091 -0.043185 -1.045528    one
2013-01-02  0.669345  1.888401  1.012291 -0.568639    one
2013-01-03  0.365531 -0.232054  0.813464 -0.467959    two
2013-01-04  1.011553  0.432133 -0.391939  0.872897  three
2013-01-05 -1.037115  0.153557  0.256157 -1.477298   four
2013-01-06 -1.183550  0.172103  0.583739  0.074280  three

In [148]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.365531 -0.232054  0.813464 -0.467959   two
2013-01-05 -1.037115  0.153557  0.256157 -1.477298  four

In [ ]:
#설정
#새 열을 설정하면 데이터가 인덱스 별로 자동 정렬

In [149]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102', periods=6))

In [150]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [151]:
df['F'] = s1

In [152]:
#라벨에 의해 값을 설정
df.at[dates[0],'A'] = 0

In [165]:
#위치에 의해 값을 설정
df.iat[0,1] = 2

In [166]:
#numpy배열을 사용한 할당에 의해 값을 설정
df.loc[:,'D'] = np.array([5] * len(df))

In [167]:
df

                   A         B         C  D    F
2013-01-01  0.000000  2.000000 -0.043185  5  NaN
2013-01-02  0.669345  1.888401  1.012291  5  1.0
2013-01-03  0.365531 -0.232054  0.813464  5  2.0
2013-01-04  1.011553  0.432133 -0.391939  5  3.0
2013-01-05 -1.037115  0.153557  0.256157  5  4.0
2013-01-06 -1.183550  0.172103  0.583739  5  5.0

In [168]:
df2 = df.copy()

In [169]:
df2[df2>0]=-df2

In [170]:
df2

                   A         B         C  D    F
2013-01-01  0.000000 -2.000000 -0.043185 -5  NaN
2013-01-02 -0.669345 -1.888401 -1.012291 -5 -1.0
2013-01-03 -0.365531 -0.232054 -0.813464 -5 -2.0
2013-01-04 -1.011553 -0.432133 -0.391939 -5 -3.0
2013-01-05 -1.037115 -0.153557 -0.256157 -5 -4.0
2013-01-06 -1.183550 -0.172103 -0.583739 -5 -5.0

# 결측치

In [173]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [174]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [175]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  2.000000 -0.043185  5  NaN  1.0
2013-01-02  0.669345  1.888401  1.012291  5  1.0  1.0
2013-01-03  0.365531 -0.232054  0.813464  5  2.0  NaN
2013-01-04  1.011553  0.432133 -0.391939  5  3.0  NaN

In [176]:
#결측치를 가지고 있는 행들을 지운다
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.669345  1.888401  1.012291  5  1.0  1.0

In [177]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  2.000000 -0.043185  5  5.0  1.0
2013-01-02  0.669345  1.888401  1.012291  5  1.0  1.0
2013-01-03  0.365531 -0.232054  0.813464  5  2.0  5.0
2013-01-04  1.011553  0.432133 -0.391939  5  3.0  5.0

# 연산

In [179]:
#일반적으로 결측치를 제외한 후 연산
#df.mean(0 or 1) 0이면 열 별로, 1이면 행 별로
df.mean()

A   -0.029039
B    0.735690
C    0.371755
D    5.000000
F    3.000000
dtype: float64

In [181]:
df.head()

                   A         B         C  D    F
2013-01-01  0.000000  2.000000 -0.043185  5  NaN
2013-01-02  0.669345  1.888401  1.012291  5  1.0
2013-01-03  0.365531 -0.232054  0.813464  5  2.0
2013-01-04  1.011553  0.432133 -0.391939  5  3.0
2013-01-05 -1.037115  0.153557  0.256157  5  4.0

In [180]:
df.mean(1)

2013-01-01    1.739204
2013-01-02    1.914007
2013-01-03    1.589388
2013-01-04    1.810350
2013-01-05    1.674520
2013-01-06    1.914458
Freq: D, dtype: float64

In [191]:
#shift 쓰면 넣는곳의 순서를 밀어줌
s = pd.Series([1,3,5,np.nan,6,8],index = dates).shift(2)

In [192]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [194]:
df.sub(s)

,2013-01-01 00:00:00,2013-01-02 00:00:00,2013-01-03 00:00:00,2013-01-04 00:00:00,2013-01-05 00:00:00,2013-01-06 00:00:00,A,B,C,D,F
2013-01-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-01-02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-01-03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-01-04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-01-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2013-01-06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [195]:
df.sub(s,axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.634469 -1.232054 -0.186536  4.0  1.0
2013-01-04 -1.988447 -2.567867 -3.391939  2.0  0.0
2013-01-05 -6.037115 -4.846443 -4.743843  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [196]:
# apply
# 데이터에 함수를 적용
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  2.000000 -0.043185   5   NaN
2013-01-02  0.669345  3.888401  0.969106  10   1.0
2013-01-03  1.034876  3.656347  1.782570  15   3.0
2013-01-04  2.046429  4.088480  1.390632  20   6.0
2013-01-05  1.009314  4.242038  1.646788  25  10.0
2013-01-06 -0.174236  4.414141  2.230527  30  15.0

In [197]:
df.apply(lambda x: x.max() - x.min())

A    2.195103
B    2.232054
C    1.404230
D    0.000000
F    4.000000
dtype: float64

In [198]:
# 히스토그래밍
s = pd.Series(np.random.randint(0,7, size=10))

In [199]:
s

0    3
1    0
2    3
3    6
4    5
5    1
6    0
7    3
8    4
9    6
dtype: int32

In [200]:
s.value_counts()

3    3
6    2
0    2
5    1
4    1
1    1
dtype: int64

In [201]:
#문자열 메소드
s = pd.Series(['A','B','C','Aaba','Baca',np.nan,'CABA','cat'])

In [202]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     cat
dtype: object

# 병합

In [204]:
#concat
df = pd.DataFrame(np.random.randn(10,4))

In [205]:
df

          0         1         2         3
0 -2.017650  0.190680 -0.393632  1.568617
1  0.376812  0.881596 -1.672166 -0.655925
2  0.397775  0.238987 -1.722197  0.272488
3  0.107486  0.471881  0.871587  0.362444
4  0.681992  0.694328  0.468825 -2.022809
5 -1.894901 -0.680363  0.372740  0.270427
6  0.985390  0.545574 -1.462919  1.690486
7 -0.871966 -0.505614  1.511277  0.123696
8  0.855143 -0.296298  0.758004  0.476396
9  0.918953  0.512316  0.134226  0.063618

In [206]:
pieces = [df[:3], df[3:7], df[7:]]

In [207]:
pd.concat(pieces)

          0         1         2         3
0 -2.017650  0.190680 -0.393632  1.568617
1  0.376812  0.881596 -1.672166 -0.655925
2  0.397775  0.238987 -1.722197  0.272488
3  0.107486  0.471881  0.871587  0.362444
4  0.681992  0.694328  0.468825 -2.022809
5 -1.894901 -0.680363  0.372740  0.270427
6  0.985390  0.545574 -1.462919  1.690486
7 -0.871966 -0.505614  1.511277  0.123696
8  0.855143 -0.296298  0.758004  0.476396
9  0.918953  0.512316  0.134226  0.063618

In [210]:
df[:3]

          0         1         2         3
0 -2.017650  0.190680 -0.393632  1.568617
1  0.376812  0.881596 -1.672166 -0.655925
2  0.397775  0.238987 -1.722197  0.272488

In [211]:
#join 결합
left = pd.DataFrame({'key' : ['foo','foo'], 'lval': [1,2]})

In [212]:
right = pd.DataFrame({'key': ['foo','foo'], 'rval':[4,5]})

In [213]:
left

   key  lval
0  foo     1
1  foo     2

In [214]:
right

   key  rval
0  foo     4
1  foo     5

In [215]:
#경우의수를 모두고려해서 병합한다
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [216]:
left = pd.DataFrame({'key' : ['foo', 'bar'], 'lval' : [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [217]:
left

   key  lval
0  foo     1
1  bar     2

In [218]:
right

   key  rval
0  foo     4
1  bar     5

In [219]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [220]:
#append
#데이터프레임에 행을 추가합니다.
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B','C','D'])

In [221]:
df

          A         B         C         D
0 -0.174575 -2.296612  0.349774 -0.821452
1  2.898030  0.269215 -0.460336 -0.060080
2 -0.182300 -0.288265  0.155533 -0.074163
3  1.125549 -0.614874  1.495171  1.521920
4  1.780048  0.826995 -0.280443  0.783825
5  0.036899 -0.122578 -0.099499 -0.997246
6  0.867483  0.228074 -1.642417 -0.630829
7  1.364567 -1.418300  0.195501  0.912266

In [224]:
s=df.iloc[3]

In [226]:
df.loc[3]

A    1.125549
B   -0.614874
C    1.495171
D    1.521920
Name: 3, dtype: float64

In [225]:
s

A    1.125549
B   -0.614874
C    1.495171
D    1.521920
Name: 3, dtype: float64

In [223]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.174575 -2.296612  0.349774 -0.821452
1  2.898030  0.269215 -0.460336 -0.060080
2 -0.182300 -0.288265  0.155533 -0.074163
3  1.125549 -0.614874  1.495171  1.521920
4  1.780048  0.826995 -0.280443  0.783825
5  0.036899 -0.122578 -0.099499 -0.997246
6  0.867483  0.228074 -1.642417 -0.630829
7  1.364567 -1.418300  0.195501  0.912266
8  1.125549 -0.614874  1.495171  1.521920

# 그룹화

In [228]:
df = pd.DataFrame(
{
    'A' : ['foo','bar','foo','bar','foo','bar','foo','foo'],
    'B' : ['one','one','two','three','two','two','one','three'],
    'C' : np.random.randn(8),
    'D' : np.random.randn(8)
})

In [229]:
df

     A      B         C         D
0  foo    one  0.290572  1.624299
1  bar    one -0.133440  0.306084
2  foo    two -0.714940 -0.569195
3  bar  three -1.416427 -0.356577
4  foo    two -1.188203 -1.915898
5  bar    two  0.839230 -4.075440
6  foo    one -1.036352 -1.386946
7  foo  three -0.285117 -0.004458

In [230]:
df.groupby('A').sum()

            C         D
A
bar -0.710638 -4.125934
foo -2.934040 -2.252198

In [231]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.133440  0.306084
    three -1.416427 -0.356577
    two    0.839230 -4.075440
foo one   -0.745780  0.237353
    three -0.285117 -0.004458
    two   -1.903143 -2.485093

# 변형

In [233]:
#Stack
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [234]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [235]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [236]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [237]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [238]:
df

                     A         B
first second
bar   one     0.609116 -0.286792
      two    -2.051489  0.324607
baz   one    -0.772452  1.616338
      two     0.551325 -0.760794
foo   one    -1.438964  0.385806
      two     0.858695 -0.174678
qux   one    -0.845223  0.096164
      two     0.742668  1.035170

In [239]:
df2=df[:4]

In [240]:
df2

                     A         B
first second
bar   one     0.609116 -0.286792
      two    -2.051489  0.324607
baz   one    -0.772452  1.616338
      two     0.551325 -0.760794

In [241]:
stacked=df2.stack()

In [242]:
stacked

first  second
bar    one     A    0.609116
               B   -0.286792
       two     A   -2.051489
               B    0.324607
baz    one     A   -0.772452
               B    1.616338
       two     A    0.551325
               B   -0.760794
dtype: float64

In [243]:
stacked.unstack()

                     A         B
first second
bar   one     0.609116 -0.286792
      two    -2.051489  0.324607
baz   one    -0.772452  1.616338
      two     0.551325 -0.760794

In [254]:
stacked.unstack(1)

second        one       two
first
bar   A  0.609116 -2.051489
      B -0.286792  0.324607
baz   A -0.772452  0.551325
      B  1.616338 -0.760794

In [256]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.609116 -0.772452
       B -0.286792  1.616338
two    A -2.051489  0.551325
       B  0.324607 -0.760794

In [257]:
# 피벗 테이블
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})

In [258]:
df

        A  B    C         D         E
0     one  A  foo -0.663530 -0.506055
1     one  B  foo -0.641071  0.556636
2     two  C  foo  0.341799 -1.336662
3   three  A  bar  0.599090  0.491385
4     one  B  bar -0.063048 -1.390958
5     one  C  bar -0.527936  2.061008
6     two  A  foo  0.248062  1.930353
7   three  B  foo -0.524986  2.221789
8     one  C  foo  1.816634  0.770834
9     one  A  bar -1.972509 -0.340451
10    two  B  bar -0.653588 -0.068247
11  three  C  bar -0.350598 -0.968099

In [261]:
pd.pivot_table(df,values='D', index=['A','B'], columns=['C'])

C             bar       foo
A     B
one   A -1.972509 -0.663530
      B -0.063048 -0.641071
      C -0.527936  1.816634
three A  0.599090       NaN
      B       NaN -0.524986
      C -0.350598       NaN
two   A       NaN  0.248062
      B -0.653588       NaN
      C       NaN  0.341799

# 시계열

In [263]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [265]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [268]:
ts

2012-01-01 00:00:00    227
2012-01-01 00:00:01    153
2012-01-01 00:00:02    327
2012-01-01 00:00:03    342
2012-01-01 00:00:04    107
                      ...
2012-01-01 00:01:35    382
2012-01-01 00:01:36    355
2012-01-01 00:01:37    364
2012-01-01 00:01:38     66
2012-01-01 00:01:39    195
Freq: S, Length: 100, dtype: int32

In [267]:
ts.resample('5Min').sum()

2012-01-01    27046
Freq: 5T, dtype: int32

In [269]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [270]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [271]:
ts

2012-03-06   -0.368617
2012-03-07    0.307507
2012-03-08    1.048863
2012-03-09   -0.247741
2012-03-10    0.483850
Freq: D, dtype: float64

In [272]:
ts_utc = ts.tz_localize('UTC')

In [273]:
ts_utc

2012-03-06 00:00:00+00:00   -0.368617
2012-03-07 00:00:00+00:00    0.307507
2012-03-08 00:00:00+00:00    1.048863
2012-03-09 00:00:00+00:00   -0.247741
2012-03-10 00:00:00+00:00    0.483850
Freq: D, dtype: float64

In [274]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -0.368617
2012-03-06 19:00:00-05:00    0.307507
2012-03-07 19:00:00-05:00    1.048863
2012-03-08 19:00:00-05:00   -0.247741
2012-03-09 19:00:00-05:00    0.483850
Freq: D, dtype: float64

In [275]:
# 시간표현 <--> 기간 표현
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [276]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [277]:
ts

2012-01-31   -2.218073
2012-02-29    0.664295
2012-03-31   -0.581208
2012-04-30   -1.371048
2012-05-31    1.679436
Freq: M, dtype: float64

In [278]:
ps = ts.to_period()

In [279]:
ps

2012-01   -2.218073
2012-02    0.664295
2012-03   -0.581208
2012-04   -1.371048
2012-05    1.679436
Freq: M, dtype: float64

In [280]:
ps.to_timestamp()

2012-01-01   -2.218073
2012-02-01    0.664295
2012-03-01   -0.581208
2012-04-01   -1.371048
2012-05-01    1.679436
Freq: MS, dtype: float64

In [281]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00   -0.425241
1990-06-01 09:00   -1.214421
1990-09-01 09:00    0.896331
1990-12-01 09:00    0.717952
1991-03-01 09:00    1.779786
Freq: H, dtype: float64